"""
字符串切片：
    从字符串中截取指定内容
    格式：
        字符串[起始索引:结束索引:步长]
    细节：
        1. 正向索引是从前往后
        2. 逆向索引是从后往前
        3. 如果不写起始索引，默认从0开始
            如果不写步长，默认是1
        4. 如果 索引 和步长方向相反，获取不到数据
        5. 特殊写法： 字符串[::-1] 表示反转字符串
"""

# 1. 定义字符串
#       a      b       c       d       e       f       g       h
# 正向： 0      1       2       3       4       5       6       7
# 逆向：-8     -7      -6      -5      -4      -3      -2      -1
s1 = 'abcdefgh'

# 2. 演示切片
print(s1[1:3])          # bc
print(s1[:5])           # abcde
print(s1[3:])           # defgh
print(s1[1:5:2])        # bd

print(s1[-6:-2])        # cdef
print(s1[-6:-2:1])      # cdef
print(s1[-6:-2:-1])     # 无数据

print(s1[-1:-5:-1])     # hgfe
print(s1[-1:-5:1])      # 无数据

print(s1[:-3])          # heb ❌  abcde ✅
print(s1[-5:])          # defgh
